<template>
  <Content>
    <h1>Правила общения
      <router-link class="logout" to="/logout">Выход</router-link>
    </h1>
    <div class="page-content">
      <Card :bordered="false">
        <h1 slot="title" style="color: #2D3748">
          Как общаться с глухими
        </h1>
        <p class="content-count">Привлеките внимание другого человека, прежде чем начать общаться ли заговорить с ним. Установите зрительный
          контакт. При необходимости вы можете помахать или легко дотронуться до человека, чтобы привлечь его внимание.
          Но вы должны быть внимательными и не тыкать людей, так как среди глухих это считается невежливым, поэтому
          слегка касайтесь людей, которых вы не знаете. Лучше всего дотронуться до плеча, несколько раз слегка нажав на
          него.
        </p>

        <p class="content-count"> Оставайтесь для них в поле зрения. Старайтесь, чтобы ваши глаза были на том же уровне, что и у них (сядьте,
          если человек сел, встаньте, если человек встал, компенсируйте большую разницу в высоте), вы должны находиться
          от него немного дальше, чем обычно (1-2 метра). Это необходимо для того, чтобы увидеть все жесты. Если вы
          находитесь в помещении, то убедитесь, что достаточно света и собеседник хорошо вас видит. Если вы находитесь
          на улице, встаньте лицом к солнцу, чтобы на него не падала тень, и не было бликов.
        </p>
        <p class="content-count">
          Поздоровайтесь нормальным голосом и тоном. Шепот или крик будут искажать ваши губы, и собеседник может не
          понять, что именно вы говорите (многие умеют читать по губам в определенной степени). Аналогично, если вы
          ускоряете движения рта, то вас будет труднее понять, чем, если бы говорили нормально. Повышение голоса
          помогает только, если человек плохо слышит, но у этого способа есть негативные стороны такие, как привлечение
          постороннего внимания, и человек, с которым вы общаетесь, будет неловко себя чувствовать. Если вы видите, что
          человек не умеет читать по губам, вы можете с ним общаться с помощью блокнота и ручки. Напишите приветствие,
          свое имя и вступление.
        </p>
      </Card>
    </div>
  </Content>
</template>

<script>
export default {
  name: "RulesPage"
}
</script>

<style scoped>
.page-content h1.title {
  color: black !important;
}
.content-count {
  font-size: 16px;
  margin-bottom: 30px;
  counter-increment: section;
  padding-left: 70px;
  position: relative;
}
.content-count::before {
  position: absolute;
  content: counter(section);
  font-size: 72px;
  left: 17px;
  top: -23px;
}


</style>